Publ/Otros/Recursos.html
<!doctype html>
<html lang="en">
<head>
<title>Recursos</title>
<!-- 2022-01-30 Sun 21:51 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="J.D Castro">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">

</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Cursos/Tutoriales</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. Lenguajes de programación en general</a></li>
<li><a href="#sec-1-2">1.2. Machine Learning/Data science</a></li>
<li><a href="#sec-1-3">1.3. Data Structures</a></li>
<li><a href="#sec-1-4">1.4. Algorithmic Trading</a></li>
<li><a href="#sec-1-5">1.5. Linux</a></li>
<li><a href="#sec-1-6">1.6. Networking</a></li>
<li><a href="#sec-1-7">1.7. \(\LaTeX\)</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Recursos escritos</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. Hacking</a></li>
<li><a href="#sec-2-2">2.2. Google Drives</a></li>
<li><a href="#sec-2-3">2.3. Bibliotecas</a></li>
<li><a href="#sec-2-4">2.4. CS</a></li>
<li><a href="#sec-2-5">2.5. Competitive Programing</a></li>
<li><a href="#sec-2-6">2.6. Security</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Patas</a>
<ul class="nav">
<li><a href="#sec-3-1">3.1. Path to pentester</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Tools</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Recursos</h1>
<blockquote>
<p>
Links a cosas que pueden ser de utilidad sobre distintos temas
</p>
</blockquote>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Cursos/Tutoriales</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Lenguajes de programación en general</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Python</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li><a href="https://realpython.com/python-debugging-pdb/">Debugging with Pdb</a>
</li>
<li><a href="https://www.slitherintopython.com">An introduction to python for beginers</a>
</li>
<li><a href="https://www.reddit.com/r/Python/comments/i0m2sy/i_know_python_basics_what_next/">I Know pthon basics, what next?</a>
</li>
<li><a href="https://www.youtube.com/watch?v=XGf2GcyHPhc">Learn python by building five games</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Go</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li><a href="https://github.com/golang/go/wiki/LearnServerProgramming">Backend in Go (learn Server Programing)</a>
</li>
<li><a href="https://towardsdatascience.com/neural-network-from-scratch-in-go-language-b98e2abcced3">Build your own Neural network in Go</a>
</li>
<li><a href="https://www.practical-go-lessons.com">Practical Go Lessons</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> C++</h4>
<div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=_bYFu9mBnr4">C++ 10 hours</a>
</li>
<li><a href="https://www.youtube.com/watch?v=GQp1zzTwrIg">C++ Full course 10 hours</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> Elisp</h4>
<div class="outline-text-4" id="text-1-1-4">
<ul class="org-ul">
<li><a href="https://github.com/p3r7/awesome-elisp">Emacs lisp resources</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-1-5" class="outline-4">
<h4 id="sec-1-1-5"><span class="section-number-4">1.1.5</span> ASM</h4>
<div class="outline-text-4" id="text-1-1-5">
<ul class="org-ul">
<li><a href="https://www.reddit.com/r/programming/comments/gatepr/game_of_life_in_32_bytes_of_assembler_source/">Game of life in 32 bytes asembler</a>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Machine Learning/Data science</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="https://www.reddit.com/r/MachineLearning/comments/fdw0ax/d_advanced_courses_update/">ML advanced curses</a>
</li>
<li><a href="https://github.com/jakevdp/PythonDataScienceHandbook">Pyhon Data Science Handbook</a>
</li>
<li><a href="https://docs.google.com/document/d/1TSxb0JrjaN4I4vRI7r-XpYuw5DxPdE2EQsCWu5irTYs/edit">Recursos de IA para pasar una buena cuarentena</a>
</li>
<li><a href="https://www.kaggle.com/learn/overview">ML Tutorials</a>
</li>
<li><a href="https://www.reddit.com/r/learnmachinelearning/comments/gy8n5b/a_beginnerfriendly_list_of_data_science_projects/">Beginer-friendly list of data science projects</a>
</li>
<li><a href="https://github.com/Machine-Learning-Tokyo/Math_resources">Math resources for Machine Learning</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Data Structures</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=RBSGKlAvoiM">Data Structures Easy to advanced 8 hours</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Algorithmic Trading</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=SEQbb8w7VTw">Algorithmic Trading Using Python</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Linux</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=wBp0Rb-ZJak">The complete Linux course 7 hours</a>
</li>
<li><a href="https://mega.nz/file/cBQj2Y5J#MX58k58WQWp-rtjwEfqCeqSn8edsfLiHy4FKLoV7VmI">Curso de administración de linux</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Networking</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li><a href="https://github.com/facyber/awesome-networking">Awesome Networking, collection of courses, books, tutorials, software and other resources </a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> \(\LaTeX\)</h3>
<div class="outline-text-3" id="text-1-7">
</div><div id="outline-container-sec-1-7-1" class="outline-4">
<h4 id="sec-1-7-1"><span class="section-number-4">1.7.1</span> katex</h4>
<div class="outline-text-4" id="text-1-7-1">
<ul class="org-ul">
<li><a href="https://katex.org/docs/supported.html">Katex reference</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-7-2" class="outline-4">
<h4 id="sec-1-7-2"><span class="section-number-4">1.7.2</span> Draw</h4>
<div class="outline-text-4" id="text-1-7-2">
<ul class="org-ul">
<li><a href="https://latexdraw.com">Drawing with tikz</a>
</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Recursos escritos</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Hacking</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><a href="https://mega.nz/folder/zGJT1QQQ#O-8yiH845GN26ajAvkoLkA">Hacking books (4chan)</a>
</li>
<li><a href="https://mega.nz/folder/YigVhZCZ#RznVxTiA0iN-N6Ps01pEJw">More hacking books (4chan)</a>
</li>
<li><a href="https://malwareunicorn.org/#/workshops">Reverse engineering workshops</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Google Drives</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> Idiomas</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li><a href="https://drive.google.com/drive/folders/16MJgoXEbA6fIHK975zlyd27HCiZnrHf6">Idiomas</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> Redes Con linux</h4>
<div class="outline-text-4" id="text-2-2-2">
<ul class="org-ul">
<li><a href="https://drive.google.com/drive/folders/1GKLrJT43Uvo-mNlWIIEWKzhNpaEK122X">Redes con linux</a>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Bibliotecas</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li><a href="https://mega.nz/folder/UBU3HIaI#hdNfSn9amoOVrT_CaBiB8w">Programing Books (large)</a>
</li>
<li><a href="https://csgordon.github.io/books.html">CS books (large)</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> CS</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li><a href="https://teachyourselfcs.com">Teach yousef CS</a>
</li>
<li><a href="https://github.com/ossu/computer-science">Path to a free self-taught education in Computer Science!</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Competitive Programing</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li><a href="https://github.com/kth-competitive-programming/kactl">KTH Algorithm Competition Template Library</a>
</li>
<li><a href="https://usaco.guide">USACO Guide</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Security</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li><a href="https://archive.is/X9M2Q">The paranoid #! Security Guide</a>
</li>
<li><a href="https://ssd.eff.org/en">Surveillance Self-defence</a>
</li>
<li><a href="https://pastebin.com/WQhRYB59">Leaning/News/CTF</a>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Patas</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Path to pentester</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><a href="https://archive.is/XB5hl">Path to pentester</a>
</li>
<li><a href="https://archive.is/7YW04#selection-389.0-394.0">Basic Knowlege requeriments</a>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Tools</h2>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: J.D Castro</p>
<p class="date">Created: 2022-01-30 Sun 21:51</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 28.0.91 (<a href="http://orgmode.org">Org-mode</a> 9.6)</p>
</div>
</footer>
</body>
</html>
